[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:120:39
           id="explanation"
           type="text"
           isInvalid={Boolean(errors.explanation)}
-          {...register("explanation", {
-            required: "explanation is required.",
-          })}
+          {...register("explanation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.js:136:23
           type="boolean"
           isInvalid={Boolean(errors.solved)}
           {...register("solved", {
-            required: "solved is required.",
+            required: "",
           })}
         />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /solved is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
