[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.js:59:5
       Header: "requestTime",
       accessor: "requestTime",
     },
-    {
-      Header: "explanation",
-      accessor: "explanation",
-    },
+    {},
     {
       Header: "solved",
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.js:63:5
       Header: "explanation",
       accessor: "explanation",
     },
-    {
-      Header: "solved",
-      accessor: "solved",
-    },
+    {},
   ];
 
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Survived] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:65:17
     },
     {
       Header: "solved",
-      accessor: "solved",
+      accessor: "",
     },
   ];
