[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-      requestTime: helpRequest.requestTime,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsCreatePage.js:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New helpRequest Created - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New helpRequest Created - id: 2 requesterEmail: joe@gmail.com"

Number of calls: 0
