[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.js:63:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Solved",
-      id: "solved",
-      accessor: (key) => key.solved.toString(),
-    },
+    {},
   ];
 
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/HelpRequests/HelpRequestTable.js:66:17
     {
       Header: "Solved",
       id: "solved",
-      accessor: (key) => key.solved.toString(),
+      accessor: () => undefined,
     },
   ];
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
