[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsCreatePage.js:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New HelpRequest Created - id: ${helpRequest.id} RequesterEmail: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New HelpRequest Created - id: 2 RequesterEmail: joe@gmail.com"

Number of calls: 0
