[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element with the text: /Id/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element with the text: /Id/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Articles/ArticlesForm.js:147:48
       <Row>
         <Col>
           <Button type="submit">{buttonLabel}</Button>
-          <Button variant="Secondary" onClick={() => navigate(-1)}>
+          <Button variant="Secondary" onClick={() => undefined}>
             Cancel
           </Button>
killedBy: ArticlesForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] UnaryOperator
main/components/Articles/ArticlesForm.js:147:63
       <Row>
         <Col>
           <Button type="submit">{buttonLabel}</Button>
-          <Button variant="Secondary" onClick={() => navigate(-1)}>
+          <Button variant="Secondary" onClick={() => navigate(+1)}>
             Cancel
           </Button>
killedBy: ArticlesForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

Ignored nodes: comments, script, style
