[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:20:35
     },
   });
 
-  const onSuccess = (articles) => {
-    toast(`New article Created - id: ${articles.id} title: ${articles.title}`);
-  };
+  const onSuccess = (articles) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New article Created - id: 3 title: Patch 25.09 Notes"

Number of calls: 0
