[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:54:34
           id="itemId"
           type="number"
           isInvalid={Boolean(errors.name)}
-          {...register("itemId", {
-            required: "ItemId is required.",
-          })}
+          {...register("itemId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /ItemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
