[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:15:7
   buttonLabel = "Create",
 }) {
   const defaultValues = initialContents
-    ? {
-        ...initialContents,
-        dateRequested: removeZ(initialContents.dateRequested),
-        dateNeeded: removeZ(initialContents.dateNeeded),
-      }
+    ? {}
     : {};
 
killedBy: RecommendationRequestForm tests renders correctly when passing in initialContents
statusReason: Error: expect(element).toHaveValue(perrytham@gmail.com)

Expected the element to have value:
  perrytham@gmail.com
Received:
