[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.js:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgcode">OrgCode</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgcode"}
-            id="orgcode"
-            type="text"
-            {...register("orgCode")}
-            value={initialContents.orgCode}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="orgcode">OrgCode</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "-orgcode"} id="orgcode" type="text" {...register("orgCode")} value={initialContents.orgCode} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'orgCode')

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgcode">OrgCode</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgcode"}
-            id="orgcode"
-            type="text"
-            {...register("orgCode")}
-            value={initialContents.orgCode}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgcode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
